uhnp/src/InformationRegisters/НастройкиОбменаФТС/НастройкиОбменаФТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОбменаФТС</name>
  <resources>
    <name>ИспользоватьОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СертификатАбонентаОтпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертификатФТСОтпечаток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьАвтонастройку</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьНесколько</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоМультирежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Доверенность</name>
    <type>
      <types>DefinedType.МашиночитаемыеДоверенностиБРО</types>
    </type>
  </resources>
  <resources>
    <name>ТипДоверенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиОбменаФТС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Процедура СохранитьСписокПользователей(
		ОрганизацияСсылка,
		Список,
		ИспользоватьНесколько,
		СертификатСтрахователяОтпечаток = "",
		Доверенность = Неопределено,
		Логин = "",
		Пароль = "") Экспорт
	
	РеквизитыНастроек = Новый Структура;
	РеквизитыНастроек.Вставить("Доверенность", 	Доверенность);
	РеквизитыНастроек.Вставить("Логин", 		Логин);
	РеквизитыНастроек.Вставить("Пароль", 		Пароль);
	
	Мультирежим.СохранитьСписокПользователейВНастройкиОбмена(
		ОрганизацияСсылка,
		Список,
		ИспользоватьНесколько,
		СертификатСтрахователяОтпечаток,
		РеквизитыНастроек,
		"НастройкиОбменаФТС",
		"СертификатАбонентаОтпечаток");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// инициализируем контекст ЭДО - модуль обработки
	ТекстСообщения = "";
	КонтекстЭДО = ДокументооборотСКО.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДО = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДО.ОбработкаПолученияФормы("РегистрСведений", "НастройкиОбменаФТС", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
